package com.company;

public class Main {

    public static void main(String[] args) {
// на скалде завода имеется некоторое кол-во деталей. детали различаются
// материалом(сталь,железо,мдеь ,дерево,пластмасса и т.р),
// назначением(комплектующие или инструменты),весом и стоимость.
// весь и стоимость задаются случайным образом. создать коллекцию деталей.
// Если стоимость детали превышает заданное значение,то выбросить свое созданное исключение.
// Обеспечить сортировку по веесу по убыванию и по стоимости по взрастанию нажатием соответсвующих кнопок
// . Кнопки расположить в верхней части

    }
}
